public class Exercise01 {

//    Конструктор по умолчанию — это специальный метод класса, который автоматически создаётся компилятором,
//    если вы не определили ни одного конструктора в классе. Этот конструктор:
//
//    Не имеет параметров.
//    Выполняет инициализацию полей объекта значениями по умолчанию:
//        Для примитивных типов (например, int, double) устанавливается 0 или 0.0.
//        Для boolean — false.
//        Для ссылочных типов (например, String, объекты других классов) — null.
}
