public class Exercise04 {
//    == — это оператор сравнения, который сравнивает ссылки на объекты (для ссылочных типов)
//    или значения (для примитивных типов).
//
//    Для примитивных типов (например, int, double):
//    == сравнивает фактические значения.
//
//    Для ссылочных типов (например, String, Object):
//    == сравнивает ссылки (адреса в памяти), а не содержимое объектов.
//
//    equals — это метод, который используется для сравнения содержимого объектов,
//    но это зависит от того, как этот метод реализован в классе.
//
//    Если метод equals не переопределён, он работает так же, как ==, то есть сравнивает ссылки.
//
//    Если класс переопределяет метод equals, он может сравнивать содержимое объектов,
//    согласно алгоритма предложенного в переопределенном методе.
}
