public class Exercise01 {
//    Default-методы позволяют добавлять новые методы в интерфейс без нарушения
//    совместимости с существующим кодом. Это позволяет расширять функциональность
//    интерфейсов
//
//    Если интерфейс уже используется в других классах или библиотеках,
//    default-методы обеспечивают обратную совместимость.
//
//    Default-методы позволяют избежать дублирования кода, если несколько классов,
//    реализующих интерфейс, должны иметь одну и ту же реализацию для какого-то метода.
//
//    Default-методы помогают создавать интерфейсы, которые можно многократно
//    использовать в различных проектах, предоставляя базовую реализацию методов.
//
//   Default-методы могут содержать вспомогательные или стандартные функции,
//   упрощая тестирование и сокращая количество повторяющегося кода.
}
