public class Exercise01 {
//    Переопределение методов при наследовании нужно если:
//    1. необходимо изменить поведение (реализацию) метода,
//    2. необходимо изменить поведение метода, не изменяя общий тип базового класса (например, Интерфейс),
//    3. необходимо добавить дополнительную логику, не изменяя поведение базового класса,
//
//    Выше перечисленное делает код более модульным и легко поддерживаемым. Так как Базовый класс определяет общую
//    структуру алгоритма, а подклассы уточняют детали.
}
